## Production: lambda-api
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 3 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                       NAME                       |
|--------|--------------------------------------------------|
| update | `aws_cloudwatch_log_group.api_gateway_log_group` |
|        | `aws_iam_policy.api`                             |
|        | `aws_iam_policy.ecr`                             |
| add    | `aws_cloudwatch_log_group.api_lambda_log_group`  |
| delete | `aws_ecr_repository.api-lambda`                  |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.api_policies will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "api_policies"  {
      ~ id      = "1153927674" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:ca-central-1:296255494825:log-group:api_gateway_log_group"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ecr:GetDownloadUrlForlayer",
                          - "ecr:BatchGetImage",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ecr:ca-central-1:296255494825:repository/notify/api-lambda"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "s3:*"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::notification-canada-ca-production-csv-upload/*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "sqs:*",
                          - "sns:Publish",
                          - "securityhub:BatchImportFindings",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "ssm:DescribeParameters"
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "ssm:GetParameters"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ssm:ca-central-1:296255494825:parameter/ENVIRONMENT_VARIABLES"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "secretsmanager:GetSecretValue"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:secretsmanager:ca-central-1:296255494825:secret:NEW_RELIC_LICENSE_KEY-3VIjR1"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "tag:GetResources",
                          - "lambda:ListTags",
                          - "lambda:ListFunctions",
                          - "lambda:ListEventSourceMappings",
                          - "lambda:ListAliases",
                          - "lambda:GetAccountSettings",
                          - "config:ListDiscoveredResources",
                          - "config:BatchGetResourceConfig",
                          - "cloudwatch:ListMetrics",
                          - "cloudwatch:GetMetricStatistics",
                          - "cloudwatch:GetMetricData",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
          ~ resources     = [
              + "",
              - "arn:aws:ecr:ca-central-1:296255494825:repository/notify/api-lambda",
            ]
            # (2 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
    }

  # aws_cloudwatch_log_group.api_gateway_log_group will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "api_gateway_log_group" {
        id                = "api_gateway_log_group"
        name              = "api_gateway_log_group"
      ~ retention_in_days = 90 -> 0
      + skip_destroy      = false
        tags              = {
            "Application" = "lambda"
            "CostCenter"  = "notification-canada-ca-production"
            "Environment" = "production"
        }
        # (2 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.api_lambda_log_group will be created
  + resource "aws_cloudwatch_log_group" "api_lambda_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/api-lambda"
      + name_prefix       = (known after apply)
      + retention_in_days = 0
      + skip_destroy      = false
      + tags              = {
          + "Application" = "lambda"
          + "CostCenter"  = "notification-canada-ca-production"
          + "Environment" = "production"
        }
      + tags_all          = {
          + "Application" = "lambda"
          + "CostCenter"  = "notification-canada-ca-production"
          + "Environment" = "production"
        }
    }

  # aws_ecr_repository.api-lambda will be destroyed
  # (because aws_ecr_repository.api-lambda is not in configuration)
  - resource "aws_ecr_repository" "api-lambda" {
      - arn                  = "arn:aws:ecr:ca-central-1:296255494825:repository/notify/api-lambda" -> null
      - id                   = "notify/api-lambda" -> null
      - image_tag_mutability = "IMMUTABLE" -> null
      - name                 = "notify/api-lambda" -> null
      - registry_id          = "296255494825" -> null
      - repository_url       = "296255494825.dkr.ecr.ca-central-1.amazonaws.com/notify/api-lambda" -> null
      - tags                 = {} -> null
      - tags_all             = {} -> null

      - encryption_configuration {
          - encryption_type = "AES256" -> null
        }

      - image_scanning_configuration {
          - scan_on_push = true -> null
        }
    }

  # aws_iam_policy.api will be updated in-place
  ~ resource "aws_iam_policy" "api" {
        id        = "arn:aws:iam::296255494825:policy/notify-api"
        name      = "notify-api"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:ca-central-1:296255494825:log-group:api_gateway_log_group"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ecr:GetDownloadUrlForlayer",
                          - "ecr:BatchGetImage",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ecr:ca-central-1:296255494825:repository/notify/api-lambda"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "s3:*"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::notification-canada-ca-production-csv-upload/*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "sqs:*",
                          - "sns:Publish",
                          - "securityhub:BatchImportFindings",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "ssm:DescribeParameters"
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "ssm:GetParameters"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ssm:ca-central-1:296255494825:parameter/ENVIRONMENT_VARIABLES"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "secretsmanager:GetSecretValue"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:secretsmanager:ca-central-1:296255494825:secret:NEW_RELIC_LICENSE_KEY-3VIjR1"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "tag:GetResources",
                          - "lambda:ListTags",
                          - "lambda:ListFunctions",
                          - "lambda:ListEventSourceMappings",
                          - "lambda:ListAliases",
                          - "lambda:GetAccountSettings",
                          - "config:ListDiscoveredResources",
                          - "config:BatchGetResourceConfig",
                          - "cloudwatch:ListMetrics",
                          - "cloudwatch:GetMetricStatistics",
                          - "cloudwatch:GetMetricData",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # aws_iam_policy.ecr will be updated in-place
  ~ resource "aws_iam_policy" "ecr" {
        id          = "arn:aws:iam::296255494825:policy/ecr-api-lambda-access"
        name        = "ecr-api-lambda-access"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action   = "ecr:GetAuthorizationToken"
                        Effect   = "Allow"
                        Resource = "*"
                        Sid      = "GetAuthorizationToken"
                    },
                  ~ {
                      ~ Resource = "arn:aws:ecr:ca-central-1:296255494825:repository/notify/api-lambda" -> ""
                        # (3 unchanged elements hidden)
                    },
                    {
                        Action   = [
                            "lambda:UpdateFunctionCode",
                            "lambda:UpdateAlias",
                            "lambda:PublishVersion",
                            "lambda:ListVersionsByFunction",
                            "lambda:ListAliases",
                            "lambda:GetFunctionConfiguration",
                            "lambda:GetFunction",
                            "lambda:GetAlias",
                        ]
                        Effect   = "Allow"
                        Resource = "arn:aws:lambda:ca-central-1:296255494825:function:api-lambda"
                        Sid      = "PermissionsToUpdateFunction"
                    },
                    # (1 unchanged element hidden)
                ]
                # (1 unchanged element hidden)
            }
        )
        tags        = {}
        # (5 unchanged attributes hidden)
    }

Plan: 1 to add, 3 to change, 1 to destroy.

Warning: Argument is deprecated

  with aws_wafv2_web_acl.api_lambda,
  on waf.tf line 1, in resource "aws_wafv2_web_acl" "api_lambda":
   1: resource "aws_wafv2_web_acl" "api_lambda" {

Use rule_action_override instead

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.alt_api_lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.api_lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_rest_api.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_stage.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.api_gateway_log_group"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.api_lambda_log_group"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-1-error-1-minute-warning-lambda-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-10-error-5-minutes-critical-lambda-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.ecr"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.api_cloudwatch"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_user.ecr-user"]
WARN - plan.json - main - Missing Common Tags: ["aws_kinesis_firehose_delivery_stream.firehose-api-lambda-waf-logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_lambda_function.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.new-relic-license-key"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_web_acl.api_lambda"]

35 tests, 17 passed, 18 warnings, 0 failures, 0 exceptions

```

</details>
